Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E11C.tmx
Source language: en_us
Languages: zh_cn

source: Courtyard Furniture & Decoration Inspiration: Be Creative When Dealing with Open Spaces
zh_cn: 怎样更有创意的布置庭院家具与装潢

source: These are some different, yet finest, examples of how beautiful you can make your courtyard, backyard or any open space catchier and even more functional.
zh_cn: 这里有几个样式不同但搭配非常出色的例子，向你展示如何把你的庭院、后院或者任何开阔空间变得更加漂亮，并且实用性十足。

source: You can definitely draw inspiration and follow the styles that many a designer or a creative housewife has tried and perfected.
zh_cn: 你可以根据自行设计的方案或者根据许多设计师和有创造力的家庭主妇尝试过和完善过的方案来装饰自己的庭院。

source: Some open spaces we found exist as a separate entity and in certain cases it is an extension of any room or space indoor.
zh_cn: 我们发现一些开阔的空间是以单独的空间形式存在的，在某些特定的情况下它有可能是室内某个房间或者空间的延伸。

source: Some work out the magic by existing as a link between the indoors and the outdoors.
zh_cn: 某些空间的作用是连接室内和室外。

source: Bridges or switchbacks can be used instead of pathways or normal pavements to bring in a unique outlook.
zh_cn: 我们可以用小桥或是之形回廊来代替走廊或者普通的过道，以创造出独特的外观。

source: Open air living rooms serve the purpose both an open as well as space in a house.
zh_cn: 开放式的起居室不仅与室外想通，而且还是室内空间的一部分。

source: You can also experiment with different styles and periods here as well, by using decks, benches and other furniture and accessories.
zh_cn: 你可以尝试选择不同的风格和样式，可以选用板材、长凳和其他的家具和装饰物。

source: Addition of succulent plants, alone or in groups can transfer the whole space into an incredible one.
zh_cn: 额外再放一盆或者是几盆肉质植物可以改变整个空间的风格。

source: Vegetation is not always necessary while arranging your terrace or open yards.
zh_cn: 在布置露台或是开阔的空间的时候，植物并不是必不可少的。

source: A few selected pieces of furniture and/or accessories can establish the fun, but only if used in a creative way.
zh_cn: 些许几件精心挑选的家具或者是装饰物就可以收到良好的效果，但前提是必须有创造性的设计方案。

source: Remember, open spaces are not only meant to entertain guests but are the best places for you to relax.
zh_cn: 记住，开阔的空间并不是给某些特定的客人准备的，而是为了给自己休息准备的。

source: So while making the priority list in organizing the spaces, never forget to take into notice your own considerations and definitions of comfort.
zh_cn: 所以在布置整个空间的时候要考虑好优先级，千万不要忘了为自己考虑，也不要忘了参照自己对于舒适的理解。

source: So get set to arrange or re-arrange the courtyards, backyards and terrace of your home, and enjoy the warm weather.
zh_cn: 那么，我们就开始布置或者重新布置自己房子的庭院、后院和露台，尽情享受温暖的天气吧。
